app/controllers/transactions_controller.rb

    def create
        transaction = Transaction.new(transaction_params)
        transaction.status = if transaction.cvv > 100
                               :paid
                             else
                               :failed
                             end
      if transaction.save
---
INSERT INTO "transactions" ("cvv", "due_date", "amount", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cvv", 783], ["due_date", "2024-06-23"], ["amount", 500.0], ["status", 1], ["created_at", "2022-08-23 01:00:15.200930"], ["updated_at", "2022-08-23 01:00:15.200930"]]